[
  {"code":"HS-PS1-1","summary":"Use the periodic table as a model to predict element properties based on electron patterns."},
  {"code":"HS-PS1-2","summary":"Construct and revise explanations for how atomic substructures relate to periodic trends and chemical properties."},
  {"code":"HS-PS1-3","summary":"Plan and conduct investigations to gather evidence that mass is conserved in chemical reactions."},
  {"code":"HS-PS1-4","summary":"Develop models to illustrate how changes in particle interactions release or absorb energy in chemical processes."},
  {"code":"HS-PS1-5","summary":"Apply scientific principles to explain how reaction rates are affected by temperature, concentration, catalysts, and surface area."},
  {"code":"HS-PS1-6","summary":"Refine the design of a chemical system by specifying condition changes that increase product formation at equilibrium."},
  {"code":"HS-PS1-7","summary":"Use mathematical representations to support the claim that atoms and mass are conserved during chemical reactions."},
  {"code":"HS-PS2-1","summary":"Analyze data to support the claim that Newton’s second law describes the relationship among net force, mass, and acceleration."},
  {"code":"HS-PS2-2","summary":"Use mathematical representations to describe and predict the effects of forces between objects."},
  {"code":"HS-PS2-3","summary":"Apply scientific and engineering ideas to design, evaluate, and refine devices that minimize force on a macroscopic object."},
  {"code":"HS-PS2-4","summary":"Use mathematical representations of gravitation and electrostatic force to describe and predict interactions between objects."},
  {"code":"HS-PS2-5","summary":"Plan and conduct an investigation to provide evidence that charged objects exert forces on each other."},
  {"code":"HS-PS3-1","summary":"Create and revise a computational model to calculate energy change of one component in a system when energy flows in or out."},
  {"code":"HS-PS3-2","summary":"Develop and use models to illustrate how energy at the macroscopic scale relates to energy at the atomic scale."},
  {"code":"HS-PS3-3","summary":"Design, build, and refine a device that converts one form of energy into another within given constraints."},
  {"code":"HS-PS3-4","summary":"Plan and conduct an investigation to provide evidence that transferring thermal energy increases particle motion in matter."},
  {"code":"HS-PS4-1","summary":"Use mathematical representations to support claims about relationships among wave frequency, wavelength, and speed."},
  {"code":"HS-PS4-2","summary":"Evaluate questions about how wave interference, reflection, refraction, and absorption affect wave energy."},
  {"code":"HS-PS4-3","summary":"Apply principles of wave behavior to design devices that use wave interference patterns."},
  {"code":"HS-PS4-4","summary":"Evaluate the validity and reliability of claims that electromagnetic radiation can be described by a wave or photon model."},
  {"code":"HS-PS4-5","summary":"Communicate technical information about how modern communication devices use wave behavior and digital signals."},
  {"code":"HS-LS1-1","summary":"Construct explanations for how DNA structure determines the structure of proteins and specialized cell systems."},
  {"code":"HS-LS1-2","summary":"Develop and use models to illustrate hierarchical organization of interacting systems in multicellular organisms."},
  {"code":"HS-LS1-3","summary":"Plan and conduct investigations to provide evidence that feedback mechanisms maintain homeostasis."},
  {"code":"HS-LS1-4","summary":"Use models to illustrate how mitosis and differentiation produce and maintain complex organisms."},
  {"code":"HS-LS1-5","summary":"Use models to explain how photosynthesis converts light energy into stored chemical energy."},
  {"code":"HS-LS1-6","summary":"Construct and revise explanations for how matter and energy flow through cellular respiration."},
  {"code":"HS-LS1-7","summary":"Use models to illustrate that cellular respiration is a chemical process where bonds break and reform to release energy."},
  {"code":"HS-LS2-1","summary":"Use mathematical and computational models to support explanations of ecosystem carrying capacity and limiting factors."},
  {"code":"HS-LS2-2","summary":"Use mathematical representations to support and revise explanations of factors affecting ecosystem stability and biodiversity."},
  {"code":"HS-LS2-3","summary":"Construct and revise explanations for how matter cycles and energy flows through aerobic and anaerobic processes."},
  {"code":"HS-LS2-4","summary":"Use mathematical representations to support claims about how energy flows and matter cycles within an ecosystem."},
  {"code":"HS-LS2-5","summary":"Develop models to illustrate the role of photosynthesis and cellular respiration in carbon cycling among the biosphere."},
  {"code":"HS-LS2-6","summary":"Evaluate claims and evidence about the impacts of resource availability on organisms and populations."},
  {"code":"HS-LS2-7","summary":"Design, evaluate, and refine solutions that reduce human impacts on biodiversity and ecosystem services."},
  {"code":"HS-LS2-8","summary":"Evaluate evidence for how group behaviors increase survival and reproduction for individuals and species."},
  {"code":"HS-LS3-1","summary":"Ask questions to clarify how DNA and chromosomes provide instructions for traits transmitted through cell cycles."},
  {"code":"HS-LS3-2","summary":"Make and defend claims about how variation and distribution of traits in a population are influenced by genetic and environmental factors."},
  {"code":"HS-LS4-1","summary":"Communicate scientific information that common ancestry and biological evolution are supported by multiple lines of evidence."},
  {"code":"HS-LS4-2","summary":"Construct explanations based on evidence for factors leading to evolution and speciation."},
  {"code":"HS-LS4-3","summary":"Apply statistics and probability to support explanations that traits offer advantages that affect survival and reproduction."},
  {"code":"HS-LS4-4","summary":"Construct explanations for how natural selection leads to adaptation of populations."},
  {"code":"HS-LS4-5","summary":"Evaluate evidence that environmental changes influence species increase, emergence of new species, or extinction."},
  {"code":"HS-LS4-6","summary":"Create or revise simulations to test solutions that reduce human impacts on biodiversity."},
  {"code":"HS-ESS1-1","summary":"Develop models of Earth-Sun-Moon orbits to explain seasons and solar energy variations."},
  {"code":"HS-ESS1-2","summary":"Construct explanations of stellar properties and life cycles using evidence from light spectra and brightness."},
  {"code":"HS-ESS1-3","summary":"Communicate scientific ideas about the expansion of the universe based on astronomical evidence."},
  {"code":"HS-ESS2-1","summary":"Develop models to explain how Earth’s internal and surface processes operate at different spatial and temporal scales."},
  {"code":"HS-ESS2-2","summary":"Analyze geoscience data to explain feedbacks that stabilize or destabilize Earth’s systems."},
  {"code":"HS-ESS2-3","summary":"Develop models to describe how circulating water at Earth’s surface and underground causes weathering and landform changes."},
  {"code":"HS-ESS2-4","summary":"Use models to describe how energy from the sun and gravity drive cycling of water and weather patterns."},
  {"code":"HS-ESS2-5","summary":"Plan and conduct investigations of the properties of water and its effects on Earth materials and surface processes."},
  {"code":"HS-ESS2-6","summary":"Develop quantitative models to describe the cycling of carbon among Earth systems."},
  {"code":"HS-ESS3-1","summary":"Construct explanations for how natural resources, hazards, and climate influence human activity."},
  {"code":"HS-ESS3-2","summary":"Evaluate cost-benefit ratios of technologies that reduce human impacts on natural systems."},
  {"code":"HS-ESS3-3","summary":"Create computational simulations to forecast and mitigate human impacts on Earth systems."},
  {"code":"HS-ESS3-4","summary":"Evaluate or refine technological solutions that reduce impacts of human activities on natural systems."},
  {"code":"HS-ESS3-5","summary":"Analyze geoscience data and climate models to make evidence-based forecasts of climate change."},
  {"code":"HS-ESS3-6","summary":"Use computational models to illustrate how human activities modify Earth systems and to design solutions."}
]
